import matplotlib.pyplot as plt

X1 = [1 , 2, 3 , 4, 5 , 6, 7, 8, 9, 10, 15, 20, 30, 40, 50, 64, 100, 256]
Y1 = [0.24, 0.195, 0.121, 0.108, 0.115, 0.224, 0.136, 0.129, 0.127, 0.138, 0.109,
      0.157, 0.158, 0.107, 0.125, 0.119, 0.105, 0.107]
Y2 = [0.505, 0.471, 0.245, 0.225, 0.321, 0.296, 0.267, 0.304, 0.265, 0.271, 0.23,
      0.255, 0.258, 0.315, 0.271, 0.245, 0.257, 0.255]
Y3 = [0.575, 0.498, 0.426, 0.417, 0.366, 0.394, 0.425, 0.387, 0.452, 0.342, 0.472,
      0.403, 0.435, 0.405, 0.425, 0.423, 0.481, 0.412]

fig = plt.figure()
# ax - окно с графиком
ax = fig.add_subplot()
# ax.axis('equal')
ax.set_title("Зависимость ускорения и эффективности алгоритма от входящих данных и количества потоков")
ax.set_xlabel('Кол-во потоков')
ax.set_ylabel('Кол-во секунд')

ax.plot(X1, Y1, 'g', label="64 элемента")
ax.plot(X1, Y2, 'r', label="128 элементов")
ax.plot(X1, Y3, 'b', label="256 элементов")

ax.legend(
    ncol = 2,    #  количество столбцов
    facecolor = 'oldlace',    #  цвет области
    edgecolor = 'r',    #  цвет крайней линии
)

ax.set(xlim=[1, 80], ylim=[0, 1])
plt.show()